CSI API ETABS v1

# cPluginContractInfo Method

---

Provides information about the plugin

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int Info(
    	ref string Text
    )

    Function Info (
    	ByRef Text As String
    ) As Integer

    Dim instance As cPluginContract
    Dim Text As String
    Dim returnValue As Integer

    returnValue = instance.Info(Text)

    int Info(
    	String^% Text
    )

    abstract Info :
            Text : string byref -> int

#### Parameters

Text

    Type: SystemString
Information about the plugin, e.g. author, version, description

#### Return Value

Type: Int32
Returns zero if the information is successfully retrieved; otherwise it
returns a nonzero value

See Also

#### Reference

cPluginContract Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com